; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_7_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 - counter
	)
  (:init
		(= (value c0) 93)
	(= (value c1) 74)
	(= (value c2) 83)
	(= (value c3) 55)
	(= (value c4) 65)
	(= (value c5) 93)
	(= (value c6) 73)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
		)
	)
)

; plan
1. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 3 of 6
2. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 3 of 6
3. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 3 of 6
4. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 3 of 6
5. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 3 of 6
6. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 3 of 6
7. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 3 of 6
8. (increase_rate c6)
   changed: (rate_value c6) from 4 to 5
   goals met: 3 of 6
9. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 3 of 6
10. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 3 of 6
11. (increment c6)
   changed: (value c6) from 73 to 78
   goals met: 3 of 6
12. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 3 of 6
13. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 3 of 6
14. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 3 of 6
15. (increment c1)
   changed: (value c1) from 74 to 80
   goals met: 3 of 6
16. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 3 of 6
17. (increment c1)
   changed: (value c1) from 80 to 87
   goals met: 2 of 6
18. (increment c6)
   changed: (value c6) from 78 to 83
   goals met: 2 of 6
19. (increment c6)
   changed: (value c6) from 83 to 88
   goals met: 2 of 6
20. (increment c6)
   changed: (value c6) from 88 to 93
   goals met: 2 of 6
21. (increment c6)
   changed: (value c6) from 93 to 98
   goals met: 3 of 6
22. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 3 of 6
23. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 3 of 6
24. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 3 of 6
25. (increase_rate c3)
   changed: (rate_value c3) from 3 to 4
   goals met: 3 of 6
26. (increase_rate c3)
   changed: (rate_value c3) from 4 to 5
   goals met: 3 of 6
27. (increase_rate c3)
   changed: (rate_value c3) from 5 to 6
   goals met: 3 of 6
28. (increment c3)
   changed: (value c3) from 55 to 61
   goals met: 3 of 6
29. (increase_rate c3)
   changed: (rate_value c3) from 6 to 7
   goals met: 3 of 6
30. (increment c3)
   changed: (value c3) from 61 to 68
   goals met: 2 of 6
31. (increase_rate c3)
   changed: (rate_value c3) from 7 to 8
   goals met: 2 of 6
32. (increase_rate c3)
   changed: (rate_value c3) from 8 to 9
   goals met: 2 of 6
33. (increase_rate c3)
   changed: (rate_value c3) from 9 to 10
   goals met: 2 of 6
34. (increase_rate c2)
   changed: (rate_value c2) from 0 to 1
   goals met: 2 of 6
35. (increase_rate c2)
   changed: (rate_value c2) from 1 to 2
   goals met: 2 of 6
36. (increase_rate c2)
   changed: (rate_value c2) from 2 to 3
   goals met: 2 of 6
37. (increase_rate c2)
   changed: (rate_value c2) from 3 to 4
   goals met: 2 of 6
38. (increase_rate c2)
   changed: (rate_value c2) from 4 to 5
   goals met: 2 of 6
39. (increase_rate c2)
   changed: (rate_value c2) from 5 to 6
   goals met: 2 of 6
40. (increment c1)
   changed: (value c1) from 87 to 94
   goals met: 3 of 6
41. (increment c3)
   changed: (value c3) from 68 to 78
   goals met: 3 of 6
42. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 3 of 6
43. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 3 of 6
44. (increment c4)
   changed: (value c4) from 65 to 67
   goals met: 3 of 6
45. (increment c4)
   changed: (value c4) from 67 to 69
   goals met: 3 of 6
46. (increment c4)
   changed: (value c4) from 69 to 71
   goals met: 3 of 6
47. (increment c4)
   changed: (value c4) from 71 to 73
   goals met: 3 of 6
48. (increment c4)
   changed: (value c4) from 73 to 75
   goals met: 3 of 6
49. (increment c4)
   changed: (value c4) from 75 to 77
   goals met: 3 of 6
50. (increment c4)
   changed: (value c4) from 77 to 79
   goals met: 4 of 6
51. (increment c2)
   changed: (value c2) from 83 to 89
   goals met: 4 of 6
52. (increment c2)
   changed: (value c2) from 89 to 95
   goals met: 5 of 6
53. (increase_rate c2)
   changed: (rate_value c2) from 6 to 7
   goals met: 5 of 6
54. (increase_rate c2)
   changed: (rate_value c2) from 7 to 8
   goals met: 5 of 6
55. (increment c3)
   changed: (value c3) from 78 to 88
   goals met: 4 of 6
56. (increment c4)
   changed: (value c4) from 79 to 81
   goals met: 4 of 6
57. (increment c3)
   changed: (value c3) from 88 to 98
   goals met: 5 of 6
58. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 5 of 6
59. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 5 of 6
60. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 5 of 6
61. (increment c4)
   changed: (value c4) from 81 to 86
   goals met: 5 of 6
62. (increment c4)
   changed: (value c4) from 86 to 91
   goals met: 5 of 6
63. (increment c4)
   changed: (value c4) from 91 to 96
   goals met: 4 of 6
64. (increment c5)
   changed: (value c5) from 93 to 95
   goals met: 4 of 6
65. (increment c5)
   changed: (value c5) from 95 to 97
   goals met: 5 of 6
66. (decrement c3)
   changed: (value c3) from 98 to 88
   goals met: 5 of 6
67. (decrement c2)
   changed: (value c2) from 95 to 87
   goals met: 5 of 6
68. (decrement c1)
   changed: (value c1) from 94 to 87
   goals met: 4 of 6
69. (decrement c1)
   changed: (value c1) from 87 to 80
   goals met: 5 of 6
70. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 5 of 6
71. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 5 of 6
72. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 5 of 6
73. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 5 of 6
74. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 5 of 6
75. (decrement c0)
   changed: (value c0) from 93 to 88
   goals met: 5 of 6
76. (decrement c0)
   changed: (value c0) from 88 to 83
   goals met: 5 of 6
77. (decrement c0)
   changed: (value c0) from 83 to 78
   goals met: 6 of 6
